podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/RTC_MKM14ZA5.svd.xml
<!--
Devices using this peripheral: 
      MKM14Z5
      MKM33Z5
      MKM34Z5
-->
      <peripheral>
         <?sourceFile "RTC_MKM14ZA5" ?>
         <name>RTC</name>
         <description>Real Time Clock</description>
         <groupName>RTC</groupName>
         <prependToName>RTC</prependToName>
         <headerStructName>RTC</headerStructName>
         <baseAddress>0x40050000</baseAddress>
         <size>16</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "16" ?>
            <offset>0x0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "16" ?>
            <offset>0x20</offset>
            <size>0xA</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "16" ?>
            <offset>0x2C</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "16" ?>
            <offset>0x32</offset>
            <size>0x6</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "16" ?>
            <offset>0x40</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>YEARMON</name>
               <description>Year and Month Counters Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x1</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>MON_CNT</name>
                     <description>These bits give the value of the Months Counter.\n
Valid Values are 1..12 =&gt; Jan..Dec</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>YROFST</name>
                     <description>Year Offset Count Value\n
These bits indicate the offset in years from the base year (hard coded as 2112) and do not show the
actual year value. This is a signed value.
Valid values are 128 to 127.
With the Base Year as 2112 and if the value of YEAR field is 0x10, the actual year will be 2112 + 16 =
2128</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAYS</name>
               <description>Days and Day-of-Week Counters Register</description>
               <addressOffset>0x2</addressOffset>
               <resetValue>0x1</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>DAY_CNT</name>
                     <description>Days Counter Value.\n
Valid values are 1..31</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DOW</name>
                     <description>Day of Week Counter Value.\n
Valid values are 0..6 =&gt; Sunday..Saturday</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HOURMIN</name>
               <description>Hours and Minutes Counters Register</description>
               <addressOffset>0x4</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>MIN_CNT</name>
                     <description>Minutes Counter Value\n
Valid count values are 0 to 59</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>HOUR_CNT</name>
                     <description>Hours Counter Value\n
Valid count values are 0 to 23</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECONDS</name>
               <description>Seconds Counters Register</description>
               <addressOffset>0x6</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>SEC_CNT</name>
                     <description>Seconds Counter Value\n
Valid count values are 0 to 59</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM_YEARMON</name>
               <description>Year and Months Alarm Register</description>
               <addressOffset>0x8</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ALM_MON</name>
                     <description>Months Value for Alarm.\n
Same as Months Counter Value in YEARMON</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ALM_YEAR</name>
                     <description>Year Value for Alarm.\n
Same as Years Offset Value in YEARMON</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM_DAYS</name>
               <description>Days Alarm Register</description>
               <addressOffset>0xA</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ALM_DAY</name>
                     <description>Days Value for Alarm.\n
Same as Days Counter Value in DAYS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM_HOURMIN</name>
               <description>Hours and Minutes Alarm Register</description>
               <addressOffset>0xC</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ALM_MIN</name>
                     <description>Minutes Value for Alarm.\n
Same as Minutes Counter Value in HOURMIN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>ALM_HOUR</name>
                     <description>Hours Value for Alarm.\n
Same as Hours Counter Value in HOURMIN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM_SECONDS</name>
               <description>Seconds Alarm Register</description>
               <addressOffset>0xE</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ALM_SEC</name>
                     <description>Seconds Value for Alarm.\n
Same as Seconds Counter Value in SECONDS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL</name>
               <description>Control Register</description>
               <addressOffset>0x10</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>FINEEN</name>
                     <description>Fine compensation enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FINEEN" > <name>COMP_EN</name> <description>Compensation enable bit 
Note:- If both the bits are meant to be set &apos;1&apos; hardware will not let the COMP_EN bit to be
written 1</description> <bitOffset>1</bitOffset> </field>
                  <field>
                     <name>ALM_MATCH</name>
                     <description>Alarm Match bits.\n
These bits define the type of alarm function. These bits select which time and calendar counters will be
used for matching and generate an alarm</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Only Seconds, Minutes, and Hours matched</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Only Seconds, Minutes, Hours, and Days matched</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Only Seconds, Minutes, Hours, Days, and Months matched</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIMER_STB_MASK</name>
                     <description>Sampling timer clocks operation in standby mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DST_EN</name>
                     <description>Daylight Saving Enable.\n
The date and time for daylight saving changes are stored in the Daylight Saving Registers. These
registers can be changed when this bit is 0. Once this bit is set, those registers cannot be changed and
when time and date match the values in those registers, daylight adjustment will happen. To disable
Daylight Saving function, this bit should be set to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWR</name>
                     <description>Software Reset bit.\n
Self clearing bit. Asserting this field clears the contents of alarm, interrupt (status and enable except
tamper interrupt enable bit ) registers, STATUS[CMP_DONE], and STATUS[BUS_ERR] and has no effect
on DST, calendaring,Standby time and tamper detect</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Inactive</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKOUT</name>
                     <description>Clock Output Selection.
Selects which clock to output from SoC for use outside RTC</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>No Output Clock</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Fine 1 Hz Clock</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>32.768 kHz Clock</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Coarse 1 Hz Clock</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status Register</description>
               <addressOffset>0x12</addressOffset>
               <resetValue>0x8</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>INVAL_BIT</name>
                     <description>Invalidate CPU read/write access bit.\n
This read-only bit indicates the time/date counters are invalid or changing</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Invalid</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Valid</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WRITE_PROT_EN</name>
                     <description>Write Protect Enable status bit.\n
This read-only bit indicates that registers are in locked mode and write to them is disabled</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Unlocked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Locked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPU_LOW_VOLT</name>
                     <description>CPU Low Voltage Warning status bit.\n
This bit is asserted when the MCU/CPU power falls below the read only threshold</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>OK</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Voltage &lt; operating level</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RST_SRC</name>
                     <description>Reset Source bit.\n
This bit indicates to the user software the cause for reset to the part and subsequent boot up of CPU</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Standby Mode Exit (Vbat was maintained)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power-On Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMP_INT</name>
                     <description>Compensation Interval bit.\n
This read-only status bit is asserted for a time equal to compensation interval seconds</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WE</name>
                     <description>Write Enable bits.\n
These bits control the entry and exit of the write protection mode. Both registers are protected by the write
protection mechanism. These are self clearing bits. Reads will return zeros</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Enable Write Protection - Registers are locked</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BUS_ERR</name>
                     <description>Bus Error bit.\n
This bit indicates that a read or write cycle was initiated by software when the INVAL_BIT was set</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Read and Write accesses are normal</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Read or Write accesses occurred when INVAL_BIT was asserted</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMP_DONE</name>
                     <description>Compensation Done bit.\n
This bit indicates that current compensation cycle is complete.\n
The bit gets cleared by writing 1 to it</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Busy</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Completed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS_B</name>
               <description>Status Register LSB</description>
               <addressOffset>0x12</addressOffset>
               <size>8</size>
               <access>read-write</access>
               <resetMask>0xFF</resetMask>
            </register>
