podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/RTC_MKM14ZA5.svd.xml
            <register>
               <name>ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <resetValue>0x1</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>TAMPER_IS</name>
                     <description>Tamper Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Inactive</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Asserted</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TAMPER_IS" > <name>ALM_IS</name> <description>Alarm Interrupt Status</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>DAY_IS</name> <description>Days Interrupt Status</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>HOUR_IS</name> <description>Hours Interrupt Status</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>MIN_IS</name> <description>Minutes Interrupt Status</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_1HZ</name> <description>1 Hz Interval Interrupt Status</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_2HZ</name> <description>2 Hz Interval Interrupt Status</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_4HZ</name> <description>4 Hz Interval Interrupt Status</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_8HZ</name> <description>8 Hz Interval Interrupt Status</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_16HZ</name> <description>16 Hz Interval Interrupt Status</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_32HZ</name> <description>32 Hz Interval Interrupt Status</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_64HZ</name> <description>64 Hz Interval Interrupt Status</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_128HZ</name> <description>128 Hz Interval Interrupt Status</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_256HZ</name> <description>256 Hz Interval Interrupt Status</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TAMPER_IS" > <name>IS_512HZ</name> <description>512 Hz Interval Interrupt Status</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x16</addressOffset>
               <resetValue>0x1</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>TAMPER_IE</name>
                     <description>Tamper Interrupt Enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TAMPER_IE" > <name>ALM_IE</name> <description>Alarm Interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>DAY_IE</name> <description>Days Interrupt Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>HOUR_IE</name> <description>Hours Interrupt Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>MIN_IE</name> <description>Minutes Interrupt Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_1HZ</name> <description>1 Hz Interval Interrupt Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_2HZ</name> <description>2 Hz Interval Interrupt Enable</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_4HZ</name> <description>4 Hz Interval Interrupt Enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_8HZ</name> <description>8 Hz Interval Interrupt Enable</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_16HZ</name> <description>16 Hz Interval Interrupt Enable</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_32HZ</name> <description>32 Hz Interval Interrupt Enable</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_64HZ</name> <description>64 Hz Interval Interrupt Enable</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_128HZ</name> <description>128 Hz Interval Interrupt Enable</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_256HZ</name> <description>256 Hz Interval Interrupt Enable</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TAMPER_IE" > <name>IE_512HZ</name> <description>512 Hz Interval Interrupt Enable</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>GP_DATA_REG</name>
               <description>General Purpose Data Register\n
The use of the bits in this register are specific to the MCU. See the Chip Configuration
chapter for description of this register. Software reset has no effect on the contents of this
register</description>
               <addressOffset>0x20</addressOffset>
               <size>16</size>
               <access>read-write</access>
               <resetMask>0xFFFF</resetMask>
            </register>
            <register>
               <name>OSC</name>
               <description>RTC Control Register\n
(Alias for GP_DATA_REG)</description>
               <addressOffset>0x20</addressOffset>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>OSC_DISABLE</name>
                     <description>32 kHz RTC OSC Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SC2P</name>
                     <description>Oscillator 2 pF Capacitor Load Configure</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Add +2 pF</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SC4P</name>
                     <description>Oscillator 4 pF Capacitor Load Configure</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Add +4 pF</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SC8P</name>
                     <description>Oscillator 8 pF Capacitor Load Configure</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Add +8 pF</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SC16P</name>
                     <description>Oscillator 16 pF Capacitor Load Configure</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Add +16 pF</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOT_MODE</name>
                     <description>Boot mode override bit\n
This bit can be used to override the boot to happen in VLPR mode. 
The effect of this bit can be seen on next system reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Boot in RUN</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Boot in VLPR</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DST_HOUR</name>
               <description>Daylight Saving Hour Register</description>
               <addressOffset>0x22</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>DST_END_HOUR</name>
                     <description>Daylight Saving Time (DST) Hours End Value.
This is the hour value for the time when DST is reversed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DST_START_HOUR</name>
                     <description>Daylight Saving Time (DST) Hours Start Value.
This is the hour value for the time when DST comes into effect</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DST_MONTH</name>
               <description>Daylight Saving Month Register</description>
               <addressOffset>0x24</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>DST_END_MONTH</name>
                     <description>Daylight Saving Time (DST) Month End Value.
This is the month value for the time when DST is reversed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DST_START_MONTH</name>
                     <description>Daylight Saving Time (DST) Month Start Value.
This is the month value for the time when DST comes in to effect</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DST_DAY</name>
               <description>Daylight Saving Day Register</description>
               <addressOffset>0x26</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>DST_END_DAY</name>
                     <description>Daylight Saving Time (DST) Day Start Value.
This is the day value for the time when DST comes into effect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DST_START_DAY</name>
                     <description>Daylight Saving Time (DST) Day End Value.
This is the day value for the time when DST is reversed</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMPEN</name>
               <description>Compensation Register\n
The compensation register stores the compensation value that will be used by the
compensation block to correct the 1 Hz clock</description>
               <addressOffset>0x28</addressOffset>
               <size>16</size>
               <access>read-write</access>
               <resetMask>0xFFFF</resetMask>
            </register>
            <register>
               <name>TAMPER_DIRECTION</name>
               <description>Tamper Direction Register</description>
               <addressOffset>0x2C</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>A_P_TAMP</name>
                     <description>Defines the active/passive selection of the tamper pins</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>I_O_TAMP</name>
                     <description>Defines the I/O capability of tamper pins.
NOTE: When the corresponding A_P_TAMP field, that is, bit 0 is set to passive mode, this field is only
readable and always reads as 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAMPER_QSCR</name>
               <description>Tamper Queue Status and Control Register</description>
               <addressOffset>0x2E</addressOffset>
               <resetValue>0x2</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>Q_FULL</name>
                     <description>Tamper Queue full status bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Q_FULL_INT_EN</name>
                     <description>Queue full interrupt enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Q_CLEAR</name>
                     <description>This field when set clears the Tamper Queue. This is an auto clear bit. It gets cleared in the next cycle</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>LFSR_CLK_SEL</name>
                     <description>This field defines the clock selection for LFSR module. This value should be the same for all the active
tamper filter clock selects (defined for the input pin)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>LFSR_DURATION</name>
                     <description>LFSR Filter duration period:- Denotes the LFSR clocks after which the LFSR shifts its value. This value
should be the same value used for all the Active tamper filter duration period (defined for the input pin)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAMPER_SCR</name>
               <description>Tamper Status and Control Register</description>
               <addressOffset>0x32</addressOffset>
               <resetValue>0x80F</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>TMPR_EN</name>
                     <description>Tamper Status Bit\n
Indicates if a tamper event was detected or not. Writing &apos;1&apos; to this field clears the tamper status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TMPR_STS</name>
                     <description>Tamper Control\n
Controls the generation of tamper interrupt from corresponding tamper status bit. Enabled on reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
