podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/RTC_MKM14ZA5.svd.xml
            <register>
               <name>FILTER01_CFG</name>
               <description>Tamper 01 Filter Configuration Register</description>
               <addressOffset>0x34</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>FIL_DUR1</name>
                     <description>Tamper Detect Bit 1 Filter Duration\n
This bit indicates the number of tamper filter clock cycles for which the TAMPER[1] signal must remains
stable before being detected as a tamper. These bits are used by the tamper filtering operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLK_SEL1</name>
                     <description>Tamper Filter 1 Clock Select\n
This bit is a write once bit and selects the clock source for tamper filter for tamper detect input bit 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>32 kHz clock</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>512 Hz clock</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>128 Hz clock</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>64 Hz clock</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>16 Hz clock</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>8 Hz clock</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>4 Hz clock</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>2 Hz clock</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL1</name>
                     <description>Tamper Detect Input Bit 1 Polarity Control\n
This bit controls the polarity of tamper detect input bit 1 (TAMPER[1])</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Active high</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Active low</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIL_DUR0</name>
                     <description>Tamper Detect Bit 0 Filter Duration\n
This bit indicates the number of tamper filter clock cycles for which the TAMPER[0] signal must remains
stable before being detected as a tamper. These bits are used by the tamper filtering operation</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field derivedFrom="CLK_SEL1" > <name>CLK_SEL0</name> <description>Tamper Filter 0 Clock Select\n
This bit is a write once bit and selects the clock source for tamper filter for tamper detect input bit 0</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="POL1" > <name>POL0</name> <description>Tamper Detect Input Bit 0 Polarity Control
This bit controls the polarity of tamper detect input bit 0 (TAMPER[0])</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>FILTER2_CFG</name>
               <description>Tamper 2 Filter Configuration Register</description>
               <addressOffset>0x36</addressOffset>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>FIL_DUR2</name>
                     <description>Tamper Detect Bit 0 Filter Duration\n
This bit indicates the number of tamper filter clock cycles for which the TAMPER[2] signal should remains
stable before being detected as a tamper. These bits are used by the tamper filtering operation</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLK_SEL2</name>
                     <description>Tamper Filter 2 Clock Select\n
This bit is a write once bit and selects the clock source for tamper filter for tamper detect input bit 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>32 kHz clock</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>512 Hz clock</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>128 Hz clock</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>64 Hz clock</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>16 Hz clock</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>8 Hz clock</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>4 Hz clock</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>2 Hz clock</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL2</name>
                     <description>Tamper Detect Input Bit 2 Polarity Control
This bit controls the polarity of tamper detect input bit 2 (TAMPER[2])</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Active high</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>TActive low</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAMPER_QUEUE</name>
               <description>Tamper Queue Register\n
Tamper queue register provides the Time stamp and the Pin number on which the tamper
occured</description>
               <addressOffset>0x40</addressOffset>
               <access>read-only</access>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>TAMPER_DATA</name>
                     <description>Tamper type stamp and pin number information register\n
The complete tamper time stamp and status information can be obtained by making two read accesses to
this register:\n
The first read gives the following information:\n
- TAMPER_DATA[4:0] = Hour\n
- TAMPER_DATA[9:5] = Day\n
- TAMPER_DATA[13:10] = Month\n
- TAMPER_DATA[15:14] = 00\n
The second read gives the remaining information, that is:\n
- TAMPER_DATA[5:0] = seconds\n
- TAMPER_DATA[11:6] = minutes\n
- TAMPER_DATA[14:12] = Tamper Index, that is, index of tamper status bits from 0 to 3\n
- TAMPER_DATA[15] = 0\n
NOTE: The year value can be obtained by reading the year counter register</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL2</name>
               <description>Control 2 Register</description>
               <addressOffset>0x42</addressOffset>
               <resetValue>0x80</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>TAMP_CFG_OVER</name>
                     <description>Tamper Configuration Over
NOTE: Set this field to 1 only when all the tamper_cfg registers are programmed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WAKEUP_STATUS</name>
                     <description>Wakeup Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>The wakeup/hibernation pin is in HiZ mode</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>The wakeup/hibernation pin is at logic 0. MCU is in sleep mode</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>The wakeup/ hibernation pin is at logic 1. MCU is in sleep mode</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WAKEUP_MODE</name>
                     <description>Wakeup Mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper pin 0 is used as the tamper pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tamper pin 0 is used as a wakeup/hibernation pin</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
